{"version":"1","records":[{"hierarchy":{"lvl1":"Agents"},"type":"lvl1","url":"/netlogo/coding/agents","position":0},{"hierarchy":{"lvl1":"Agents"},"content":"Agents are the main actors in NetLogo. They can be turtles, patches, links, or the observer. Each agent has its own set of properties and behaviors.\n\nThe turtles are the most common type of agent. They can move around the world, interact with other turtles, and change their properties. Turtles can also have different shapes and colors, which can be used to represent different types of agents in your model.\n\nThe world is made up of patches, which are the individual squares that make up the 2D grid. Each patch can have its own properties, such as color and elevation. Patches can also be used to represent different types of terrain or resources in your model. The turtles can move around the patches and interact with them, which allows you to create complex models of behavior and interaction.\n\nLinks are a type of agents used to connect turtles and represent relationships between them. They can be used to represent social networks, transportation systems, or any other type of connection between agents.\n\nThe observer is a special agent that can control the simulation and interact with the other agents. The observer can create and destroy turtles, change the properties of patches, and control the flow of the simulation. The observer can also be used to create user interfaces, such as buttons and sliders, to control the simulation. It is important to note that the observer does not have any properties or behaviors of its own, but it can interact with all other agents in the simulation.\n\nNote\n\nWhen NetLogo is initiate, there are no turtles in the world. The observer can create turtles using the create-turtles command. Patches can also create turtles using the sprout command.\n\nPatches can’t move, but you can consider them as active agents from the beggining.","type":"content","url":"/netlogo/coding/agents","position":1},{"hierarchy":{"lvl1":"Coding Tab"},"type":"lvl1","url":"/netlogo/coding","position":0},{"hierarchy":{"lvl1":"Coding Tab"},"content":"In this section, we will cover the coding aspects of using NetLogo, including the interface, the programming language, and best practices for writing NetLogo code.","type":"content","url":"/netlogo/coding","position":1},{"hierarchy":{"lvl1":"Programming in NetLogo"},"type":"lvl1","url":"/netlogo","position":0},{"hierarchy":{"lvl1":"Programming in NetLogo"},"content":"This guide follows the same structure as the \n\nNetLogo documentation, but it is tailored to our course. It is not a replacement for the official documentation, but rather a complement to it. We own all the credit for this material to Ury Wilensky and the Center for Connected Learning and Computer-Based Modeling at Northwestern University \n\nWilensky (1999). The official documentation is a great resource, and we encourage you to use it as well.\n\nIn this tutorial, we intend to provide the basic concepts and programming skills necessary to start programming in NetLogo. This tutorial is focused on programming. Come back to this part whenever you need to refresh your memory on the basic concepts of programming in NetLogo.","type":"content","url":"/netlogo","position":1},{"hierarchy":{"lvl1":"What are Models?"},"type":"lvl1","url":"/intro/a-whatisamodel","position":0},{"hierarchy":{"lvl1":"What are Models?"},"content":"By the end of this unit, students will be able to...\n\nexplain what is a model and differenciate equation models from agent models;\n\nuse Netlogo for opening models from the models library;\n\nnavigate through Netlogo tabs (interface, info and code);\n\nbuild a simple model to create turtles and move them around the World.","type":"content","url":"/intro/a-whatisamodel","position":1},{"hierarchy":{"lvl1":"HNRS251 - Social Computing"},"type":"lvl1","url":"/","position":0},{"hierarchy":{"lvl1":"HNRS251 - Social Computing"},"content":"Welcome to the Social Computing class!\n\nThis is a course that will involve two areas of knowledge: social sciences and computer science. In the following weeks we will wrestle with models of reality, providing understanding and challenges about humans and societies. Using Lewis Smedes standpoint on models, in our fallen world, we are meant to create some imperfect models of the good world that will one day come about \n\nSmedes (2003). And that’s what we will try to do.\n\nThis will be a hands-on course, where we will learn by doing. As we do, we will also reflect and learn important concepts and ideas that will nurture our understanding of the world and our place in it.","type":"content","url":"/","position":1},{"hierarchy":{"lvl1":"HNRS251 - Social Computing","lvl2":"Instructors"},"type":"lvl2","url":"/#instructors","position":2},{"hierarchy":{"lvl1":"HNRS251 - Social Computing","lvl2":"Instructors"},"content":"Prof. Jonathan Hill and \n\nProf. Eric Araújo will be your guides in this journey.\n\nThe following links provide the office hours and contact information for both professors:\n\nInstructor\n\nOffice Hours\n\nContact\n\nProf. Jonathan Hill\n\nhttps://​www​.jonathanhill​.org/\n\njonathan​.hill@calvin​.edu\n\nProf. Eric Araújo\n\nMy Agenda\n\neric​.araujo@calvin​.edu\n\nHNRS251A - Honors Computer Science\n\nProgramming in NetLogo\n\nCoding Tab\n\nAgents\n\nWhat are Models?","type":"content","url":"/#instructors","position":3}]}